X <- rbind(c(13,38), c(24,30)) #матрица
y <- cbind(c(100,160)) #Вектор-столбец коненчого потребления
x <- cbind(c(151, 219)) #Вектор-столбец объёмов проихводства

y2 <- cbind(c(200, 160)) #новый вектор-столбец коненчого потребления (по усл)

cat("Матрица таблицы")
X
cat("Вектор-столбец коненчого потребления")
y
cat("Вектор-столбец объёмов производства")
x
cat("Новый вектор-столбец коненчого потребления (по усл)")
y2

cat(" ")
E <- diag(2) #Единичная матрица 2х2
cat("Единичная матрица 2х2")
E

A <- rbind(c(0,0),c(0,0)) # Составление матрицы из двух строк-векторов
A[1,1] <- X[1,1]/x[1] # Построение матрицы прямых затрат A
A[2,1] <- X[2,1]/x[1]
A[1,2] <- X[1,2]/x[2]
A[2,2] <- X[2,2]/x[2]
cat(" ")
cat("Матрица прямых затрат")
A 

EA <- E-A #Построение матрицы (E-A)
cat(" ")
cat("Матрица (E-A)")
EA

S <- solve(EA) #Матрица полных затрат S=(E-A)−1
cat(" ")
cat("Матрица полных затрат")
S

cat(" ")
cat("Проверка продуктивности матрицы")
all(S>0) #Проверка продуктивности матрицы
if(all(S>0)) cat("Матрица A продуктивна")

cat(" ")
cat("Cобственные значения и собств. векторы матрицы A")
eigen(A) #Вычисление собственных значений и собств. векторов матрицы A

d <- eigen(A)$value
cat(" ")
cat("Число Фробениуса")
lambda_A <- max(d);lambda_A #Определение числа Фробениуса
cat(" ")
cat("Собств. векторы A, стоящие в столбцах матр. P")
P <- eigen(A)$vectors; P # Собств. векторы A, стоящие в столбцах матр. P

cat(" ")
cat("Вектор объемов производства по отраслям")
x1 <- S %*% y; x1 #Вектор объемов производства по отраслям (x1=x)
cat("Вектор новых объемов производства по отраслям")
x2 <- S %*% y2; x2 #Вектор новых объемов производства по отраслям

#Чистая продукция отрасли - разность между валовой продукцией этой отрасли и продукцией всех отраслей на производство этой отрасли
xc <- cbind(c(0,0)) # Вектор-столбец выпуска чистой продукции
x11<-A[1,1]*x2[1]
x21<-A[2,1]*x2[1]
xc[1]<-x2[1]-(x11+x21)
x12<-A[1,2]*x2[2]
x22<-A[2,2]*x2[2]
xc[2]<-x2[2]-(x12+x22)
cat(" ")
cat("Вектор-столбец выпуска чистой продукции")
xc


#Вывод
cat(" ")
cat("Вывод:")
cat("Матрица прямых затрат")
A
cat("Матрица A продуктивна")
cat("Число Фробениуса")
lambda_A
cat("Вектор Фробениуса")
cat("(-0.6691380; -0.7431382)")
cat("Вектор новых объемов производства по отраслям")
x2
cat("Вектор-столбец выпуска чистой продукции")
xc

x_cols <- cbind(x, x2)
x_cols

barplot(x_cols, density = 10, beside = TRUE, col = topo.colors(2), 
        space = 1, ylab = "Объёмы производства", xlab = "Отрасли", ylim = c(0,300))

